GT2/GT2/RANS/KEpsilon_realizable_highRE/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

//1 to 10 times laminar vis
internalField   uniform 2e-07;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    slipsurface
    {
        //type            zeroGradient;
        type            slip;
    }
    bottom
    {
        //type            fixedValue;
        //value           uniform 0;

        //type 	   	      nutUSpaldingWallFunction;
        //value           uniform 0;

        //type            nutUWallFunction;
        //value           uniform 0;

        type 	   	      nutkWallFunction;
        value             uniform 0;
    }

    frontandback
    {
	type	empty;
    }
}

// ************************************************************************* //
